#include <stdio.h>
int main()
{
	int X[4][3] = { {3,4,3},{0,3,4},{1,1,7},{2,3,1} };
	int Y[4][3] = { {4,2,3},{0,1,1},{3,0,3},{3,1,2} };
	int P[3][4] = { 0 };
	int Q[4][2] = { 0 };

	int R[3][2] = { 0 };
	int Z[5][3];

	//X,Y를 보고 P,Q를 생성
	int i;
	for (i = 1; i < 4; ++i)
	{
		P[X[i][0]][X[i][1]] = X[i][2];
		Q[Y[i][0]][Y[i][1]] = Y[i][2];
	}

	//행렬 곱
	int j, k;
	for(i=0; i<3; ++i)
		for (j = 0; j < 2; ++j)
			for (k = 0; k < 4; ++k)
				R[i][j] += P[i][k] * Q[k][j];

	//R 축소
	Z[0][0] = 3;
	Z[0][1] = 2;
	int c = 0;
	for(i=0; i<3; ++i)
		for(j=0; j<2; ++j)
			if (R[i][j])
			{
				c++;
				Z[c][0] = i;
				Z[c][1] = j;
				Z[c][2] = R[i][j];
			}
	Z[0][2] = c;

	printf("Z[0][1] = %d\n", Z[0][1]);
	printf("Z[0][2] = %d\n", Z[0][2]);
	printf("Z[1][0] = %d\n", Z[1][0]);
	printf("Z[3][2] = %d\n", Z[3][2]);

	return 0;

	// Z[3][2]는 2가 아니라 3임을 알 수 있다.

	//4번이 답.
}